package verifyjc

type JcConfig struct {
	MaxMultiple int      //最大倍数
	MaxZhu      int      //最大注数
	Spf         []string //胜平负
	Rqspf       []string //让球胜平负
	Bqc         []string //半全场
	Bf          []string //比分
	Zjq         []string //总进球
	LqSf        []string //篮球胜负
	LqRqSf      []string //篮球让球胜负
	LqSfC       []string //篮球胜分差
	LqDxf       []string //篮球大小分
	SpfCode     int      //胜平负彩种ID
	RqspfCode   int      //让胜平负彩种ID
	BqcCode     int      //半全场彩种ID
	BfCode      int      //比分彩种ID
	ZjqCode     int      //总进球彩种ID
	Htcode      int      //混合投注ID
	LqSfCode    int      //篮球胜负
	LqRqSfCode  int      //篮球让球胜负
	LqSfCCode   int      //篮球胜分差
	LqDxfCode   int      //篮球大小分
	LqHtCode    int      //篮球混合投注

	SpfBet map[string]string //胜平负投注内容解析
	RqsBet map[string]string //让胜平负投注内容解析
	BqcBet map[string]string //半全场投注内容解析
	BfBet  map[string]string //比分投注内容解析
	ZjqBet map[string]string //总进球投注内容解析

	MatchChuan      map[string]int      //串关方式的比赛数量 自由过关
	MatchChuanGroup map[string]int      //串关方式的比赛数量 组合过关
	MaxChuan        map[string]int      //最多串关方式
	ManyChuan       map[string][]string //多关拆关

}

var JcConf JcConfig = JcConfig{
	MaxMultiple: 50,
	MaxZhu:      10000,
	Spf:         []string{"3", "1", "0"},                                                                                                                                                                            //胜平负
	Rqspf:       []string{"3", "1", "0"},                                                                                                                                                                            //让球胜平负
	Bqc:         []string{"33", "31", "30", "13", "11", "10", "03", "01", "00"},                                                                                                                                     //半全场
	Bf:          []string{"90", "10", "20", "21", "30", "31", "32", "40", "41", "42", "50", "51", "52", "99", "00", "11", "22", "33", "09", "01", "02", "12", "03", "13", "23", "04", "14", "24", "05", "15", "25"}, //比分
	Zjq:         []string{"0", "1", "2", "3", "4", "5", "6", "7"},
	SpfBet:      map[string]string{"3": "胜", "1": "平", "0": "负"},                                                                                                                                                                                                                                                                                                                                                                                      //胜平负投注内容解析
	RqsBet:      map[string]string{"3": "胜", "1": "平", "0": "负"},                                                                                                                                                                                                                                                                                                                                                                                      //让胜平负投注内容解析
	BqcBet:      map[string]string{"33": "胜胜", "31": "胜平", "30": "胜负", "13": "平胜", "11": "平平", "10": "平负", "03": "负胜", "01": "负平", "00": "负负"},                                                                                                                                                                                                                                                                                                        //半全场投注内容解析
	BfBet:       map[string]string{"90": "胜其他", "10": "1:0", "20": "2:0", "21": "2:1", "30": "3:0", "31": "3:1", "32": "3:2", "40": "4:0", "41": "4:1", "42": "4:2", "50": "5:0", "51": "5:1", "52": "5:2", "99": "平其他", "00": "0:0", "11": "1:1", "22": "2:2", "33": "3:3", "09": "负其他", "01": "0:1", "02": "0:2", "12": "1:2", "03": "0:3", "13": "1:3", "23": "2:3", "04": "0:4", "14": "1:4", "24": "2:4", "05": "0:5", "15": "1:5", "25": "2:5"}, //比分投注内容解析
	ZjqBet:      map[string]string{"0": "0球", "1": "1球", "2": "2球", "3": "3球", "4": "4球", "5": "5球", "6": "6球", "7": "7+球"},                                                                                                                                                                                                                                                                                                                           //总进球投注内容解析

	LqSf:            []string{"3", "0"},                                                      //篮球胜负
	LqRqSf:          []string{"3", "0"},                                                      //篮球让球胜负
	LqSfC:           []string{"1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12"}, //篮球胜分差
	LqDxf:           []string{"1", "2"},                                                      //篮球大小分
	SpfCode:         40,                                                                      //竞彩足球胜平负彩种ID
	RqspfCode:       41,                                                                      //竞彩足球让胜平负彩种ID
	BqcCode:         44,                                                                      //竞彩足球半全场彩种ID
	BfCode:          42,                                                                      //竞彩足球比分彩种ID
	ZjqCode:         43,                                                                      //竞彩足球总进球彩种ID
	Htcode:          45,                                                                      //竞彩足球混合投注
	LqSfCode:        46,                                                                      //篮球胜负
	LqRqSfCode:      47,                                                                      //篮球让球胜负
	LqSfCCode:       48,                                                                      //篮球胜分差
	LqDxfCode:       49,                                                                      //篮球大小分
	LqHtCode:        50,                                                                      //篮球混合投注
	MatchChuan:      map[string]int{"1_1": 1, "2_1": 2, "3_1": 3, "4_1": 4, "5_1": 5, "6_1": 6, "7_1": 7, "8_1": 8},
	MatchChuanGroup: map[string]int{"3_3": 3, "3_4": 3, "4_4": 4, "4_5": 4, "4_6": 4, "4_11": 4, "5_5": 5, "5_6": 5, "5_10": 5, "5_16": 5, "5_20": 5, "5_26": 5, "6_6": 6, "6_7": 6, "6_15": 6, "6_20": 6, "6_22": 6, "6_35": 6, "6_42": 6, "6_50": 6, "6_57": 6, "7_7": 7, "7_21": 7, "7_35": 7, "7_120": 7, "8_8": 8, "8_9": 8, "8_28": 8, "8_56": 8, "8_70": 8, "8_247": 8},
	MaxChuan: map[string]int{
		"40": 8,
		"41": 8,
		"42": 4,
		"43": 6,
		"44": 4,
		"45": 8,
		"46": 8,
		"47": 8,
		"48": 4,
		"49": 8,
		"50": 8,
	},
	ManyChuan: map[string][]string{
		"3_3":   []string{"2_1"},
		"3_4":   []string{"2_1", "3_1"},
		"4_4":   []string{"3_1"},
		"4_5":   []string{"3_1", "4_1"},
		"4_6":   []string{"2_1"},
		"4_11":  []string{"2_1", "3_1", "4_1"},
		"5_5":   []string{"4_1"},
		"5_6":   []string{"4_1", "5_1"},
		"5_10":  []string{"2_1"},
		"5_16":  []string{"3_1", "4_1", "5_1"},
		"5_20":  []string{"2_1", "3_1"},
		"5_26":  []string{"2_1", "3_1", "4_1", "5_1"},
		"6_6":   []string{"5_1"},
		"6_7":   []string{"5_1", "6_1"},
		"6_15":  []string{"2_1"},
		"6_20":  []string{"3_1"},
		"6_22":  []string{"4_1", "5_1", "6_1"},
		"6_35":  []string{"2_1", "3_1"},
		"6_42":  []string{"3_1", "4_1", "5_1", "6_1"},
		"6_50":  []string{"2_1", "3_1", "4_1"},
		"6_57":  []string{"2_1", "3_1", "4_1", "5_1", "6_1"},
		"7_7":   []string{"6_1"},
		"7_8":   []string{"6_1", "7_1"},
		"7_21":  []string{"5_1"},
		"7_35":  []string{"4_1"},
		"7_120": []string{"2_1", "3_1", "4_1", "5_1", "6_1", "7_1"},
		"8_8":   []string{"7_1"},
		"8_9":   []string{"7_1", "8_1"},
		"8_28":  []string{"6_1"},
		"8_56":  []string{"5_1"},
		"8_70":  []string{"4_1"},
		"8_247": []string{"2_1", "3_1", "4_1", "5_1", "6_1", "7_1", "8_1"},
	},
}
